##python数据准备##
一、获取数据源---获取食材
1.1 导入外部数据
1.2 新建数据
1.3 熟悉数据
1.4 本关作业
二、数据预处理---淘米洗菜
2.1 缺失值处理
2.2 重复值处理
2.3 异常值处理
2.4 数据类型转换
2.5 索引设置
2.6 数值操作
2.7 字符串操作
2.8 重命名列名
2.9 本关作业
三、数据选择---选配菜品
3.1 列选择
3.2 行选择
3.3 行列同时选择
3.4 数值操作-感觉应该放在数据预处理部分
3.5 本关作业

# 一、获取数据源

## 1.1 导入外部数据

导入数据主要用到Pandas里的read_x()方法，x表示待导入文件的格式

1、导入xlsx文件

In [2]:
#导入.xlsx文件
import pandas as pd
df = pd.read_excel(r"/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/test.xlsx") #r是转义符
df

   编号  年龄 性别       注册时间
0  A1  10  男 2018-01-23
1  A2  20  女 2018-02-14
2  A3  30  女 2018-03-18

In [6]:
#导入.xlsx文件，并指定sheet,指定行索引，指定列索引
df1 = pd.read_excel(r"/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/test.xlsx",
                   sheet_name=0,index_col=0,header=0) 
df1
#sheet_name参数可以指定具体sheet的名字，也可以指定顺序，从0开始计数
#index_col参数指定行索引，默认从0开始
#header参数指定列索引，默认从0开始

    年龄 性别       注册时间
编号
A1  10  男 2018-01-23
A2  20  女 2018-02-14
A3  30  女 2018-03-18

In [7]:
#指定导入列--当文件列数太多，我们又不需要那么多列时，用usecols参数来指定导入列
df2 = pd.read_excel(r"/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/test.xlsx",
                   sheet_name=0,index_col=0,header=0,usecols=[0,2]) 
df2

   性别
编号
A1  男
A2  女
A3  女

2、导入csv文件

In [15]:
#导入csv文件
import pandas as pd
df_csv = pd.read_csv(r"/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/train-pivot.csv",
                    encoding="gbk",sep= ",",nrows=2)
df_csv

    用户ID 客户分类    区域 是否省会  7月销量  8月销量  9月销量
0  59224   A类  一线城市    是     6    20     0
1  55295   B类  三线城市    否    37    27    35

官方文档：http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html?highlight=read_csv#pandas.read_csv

pandas.read_csv(filepath_or_buffer, sep=', ', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)

header:默认是第一列，=None表示没有表头
names:给没有表头的数据表赋予表头字段
dtype：设置各字段格式，例子{‘a’: np.float64, ‘b’: np.int32, ‘c’: ‘Int64’} 
parse_dates : 将某些列解析成日期格式
encoding参数指定编码格式，查看文件类型，若是CSV UTF-8(逗号分隔)(*.csv)文件，encoding="utf-8";若是CSV (逗号分隔)(*.csv)文件，encoding="gbk"
sep参数指明分隔符号，常见的分隔符号有逗号、空格、制表符\t
nrows参数指明读取行数
engine指定 当文件路径或文件名包含中文时，用上面的方式有可能会报错，这个错误的产生原因是当调用read_csv()方法时，默认使用C语言作为解析语言，需要将默认解析语言更改为python即可，如果文件类型是CSV UTF-8(逗号分隔)(.csv)文件，encoding="utf-8-sig";若是CSV (逗号分隔)(.csv)文件，encoding="gbk"
ndex_col参数指定行索引，默认从0开始;header参数指定列索引，默认从0开始

In [20]:
df_csv1 = pd.read_csv(r"/Users/Eric/Documents/2019/learning/1_python/对比Excel,轻松学习Python数据分析数据集/train-pivot.csv",
                    engine="python",encoding="gbk",sep= ",",nrows=3,index_col=0,header=0,usecols=[0,2,4])
df_csv1

         区域  7月销量
用户ID
59224  一线城市     6
55295  三线城市    37
46035  二线城市     8

3、导入txt文件

python中导入.txt文件用的方法是read_table(),它是将利用分隔符分开的文件导入DataFrame的通用函数，不仅可以导入.txt文件，还可以导入.csv文件

4、导入数据库数据

In [39]:
import pandas as pd
import pymysql

In [40]:
eng = pymysql.connect(host='***',
                     user='***'',
                     password='***'',
                     port=***',
                     charset='utf8')

host-数据库地址/本机用localhost;
user-用户名;
password-密码;
db-某一数据库名，也可以不写；
charset-数据库编码，一般为UTF-8。

连接好数据库之后，就可以执行sql查询语句，用pd.read_sql(sql,con);
参数sql是需要执行的sql语句；参数con是第一步创建好的数据库连接。

In [1]:
df_sql=pd.read_sql("select * from super_monkey_data_view.boxinfo limit 10",eng)
df_sql

NameError: name 'pd' is not defined

# 1.2 新建数据

这里的新建数据主要指DataFrame数据，利用pd.DataFrame()方法，已经讲过，不再赘述。

# 1.3 熟悉数据

1、用head()方法预览数据

In [11]:
df_sql.head(2)
#相当于sql里面select *  from 库名.表名 limit 1

,boxId,boxSerialNo,boxname,brandName,branchName,boxShortName,boxFunctionType,bookingCountLimit,price,region,...,images,webImage,note,badgeId,display,hardware,priority,newStoreDiscount,boxType,remark
0,101,CK-001,深圳仓库,仓库,深圳仓库,深圳仓库,0,0,9999,华南地区,...,None,,[],0,0,boxNone,100,0,1,
1,102,CK-002,上海仓库,仓库,上海仓库,上海仓库,0,0,9999,华东地区,...,None,,[],0,0,boxNone,100,0,1,

2、利用shape方法获取数据集的大小

In [17]:
df_sql.shape
#相当于sql里面select count(*) from 库名.表名

(10, 30)

3、利用info()获取数据类型

In [13]:
df_sql.info()
#相当于sql里面show columns from 库名.表名

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 30 columns):
boxId                10 non-null int64
boxSerialNo          10 non-null object
boxname              10 non-null object
brandName            10 non-null object
branchName           10 non-null object
boxShortName         10 non-null object
boxFunctionType      10 non-null int64
bookingCountLimit    10 non-null int64
price                10 non-null int64
region               10 non-null object
province             10 non-null object
city                 10 non-null object
area                 10 non-null object
address              10 non-null object
addressEn            10 non-null object
longitude            10 non-null float64
latitude             10 non-null float64
keywords             10 non-null object
description          7 non-null object
phonenumber          10 non-null object
images               7 non-null object
webImage             10 non-null object
note                 10 non-null object
badgeId              10 non-null int64
display              10 non-null int64
hardware             10 non-null object
priority             10 non-null int64
newStoreDiscount     10 non-null int64
boxType              10 non-null int64
remark               10 non-null object
dtypes: float64(2), int64(9), object(19)
memory usage: 2.4+ KB

4、利用describe获取数值分布情况

In [15]:
df_sql.describe()
#这个比直接在数据库里面写SQL查方便很多，数据库的SQL需要用多个函数并group by 不同列才能结合得到。

,boxId,boxFunctionType,bookingCountLimit,price,longitude,latitude,badgeId,display,priority,newStoreDiscount,boxType
count,10.000000,10.000000,10.0,10.000000,10.0,10.0,10.000000,10.0,10.0,10.0,10.0
mean,722.900000,1.400000,0.0,702999.000000,0.0,0.0,-0.700000,0.0,100.0,0.0,1.0
std,428.465596,0.966092,0.0,478215.432624,0.0,0.0,0.483046,0.0,0.0,0.0,0.0
min,101.000000,0.000000,0.0,9999.000000,0.0,0.0,-1.000000,0.0,100.0,0.0,1.0
25%,323.750000,0.500000,0.0,257499.000000,0.0,0.0,-1.000000,0.0,100.0,0.0,1.0
50%,987.500000,2.000000,0.0,999999.000000,0.0,0.0,-1.000000,0.0,100.0,0.0,1.0
75%,989.750000,2.000000,0.0,999999.000000,0.0,0.0,-0.250000,0.0,100.0,0.0,1.0
max,992.000000,2.000000,0.0,999999.000000,0.0,0.0,0.000000,0.0,100.0,0.0,1.0

# 1.4 本关作业

1、导入xlsx格式的文件的方法？---pd.read_excel(),需要先引入pandas包
2、导入csv文件用到的方法？---pd.read_csv()
3、导入xlsx文件用来指名sheet的参数？---sheet_name=0,默认从0开始
4、导入文件时要将“用户编号”这一列设置为行索引用的参数？---header=0,默认从0开始
5、导入文件时要指定导入某两列的参数？---usecols[x,y]
6、csv文件一般有哪两种编码格式？用什么参数来设置？---gbk和utf-8,encoding
7、导入csv文件，当文件名或路径包含中文时，需要额外设置什么参数？---engine="python"
8、通过连接数据库直接获取数据用什么方法？---pd.read_sql()
9、怎么预览表df的前3行？---df.head(3)
10、怎么查看df的行列数？---df.shape()
11、怎么查看df表每一列的数据类型？---df.info()

# 二、数据预处理

# 2.1 缺失值处理-info(),isnull(),dropna(),dropna(how='all'),df.fillna({})

In [16]:
import pandas as pd
df=pd.DataFrame([['1001',50,'男'],
              ['1002',20,'女'], 
               ['1003',30],
                [],
                ['1004',40,'女']],columns=['编号','年龄','性别'])
df

     编号    年龄    性别
0  1001  50.0     男
1  1002  20.0     女
2  1003  30.0  None
3  None   NaN  None
4  1004  40.0     女

In [17]:
#查看缺失值
df.info()
#相当于SQL里面计算每一列的非null值，select count(编号/年龄/性别) from 库名.表名

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
编号    4 non-null object
年龄    4 non-null float64
性别    3 non-null object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

index:0-4说明有5行；columns有3列。编号有4个非空值，性别有3个非空值，说明编号有1行为空，性别有2行数值为空。

In [28]:
df.isnull()
#这个函数能很直观看到空值情况，但是数据量大时不适用

      编号     年龄     性别
0  False  False  False
1  False  False  False
2  False  False   True
3   True   True   True
4  False  False  False

In [29]:
#缺失值删除
df.dropna()  #把所有缺失值删除
#相当于在sql里面利用where语句条件过滤掉缺失值

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
4  1004  40  女

In [30]:
#只删除空白行
df.dropna(how='all')

     编号  年龄    性别
0  1001  50     男
1  1002  20     女
2  1003  30  None
4  1004  40     女

In [38]:
#缺失值填充
df.fillna({'性别':'男'})

     编号    年龄 性别
0  1001    50  男
1  1002    20  女
2  1003    30  男
3  None  None  男
4  1004    40  女

In [18]:
#缺失值填充---均值填充
df.fillna({'年龄':df['年龄'].mean})

     编号                                                 年龄    性别
0  1001                                                 50     男
1  1002                                                 20     女
2  1003                                                 30  None
3  None  <bound method Series.mean of 0    50.0\n1    2...  None
4  1004                                                 40     女

# 2.2 重复值处理

In [41]:
df_sql2=pd.read_sql("select * from super_monkey_data_view.boxinfo",eng)

In [42]:
#统计重复值
df_sql2.duplicated().sum()
#sql里面也有统计重复值的方法，详见https://www.cnblogs.com/firstdream/p/5826238.html

0

In [43]:
#删除重复值
df_sql2.drop_duplicates(inplace=True)

In [44]:
df_duplicate=pd.DataFrame([['1001','50','男'],
              ['1002','20','女'],['1002','20','女'],
                ['1004','40','女'], ['1005','40','女']],columns=['编号','年龄','性别'])
df_duplicate

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
2  1002  20  女
3  1004  40  女
4  1005  40  女

In [45]:
#按全部列统计重复值
df_duplicate.duplicated().sum()

1

In [46]:
#按具体列统计重复值
df_duplicate.duplicated(subset=['年龄','性别']).sum()

2

In [47]:
#按全部列删除重复值
df_duplicate.drop_duplicates()

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
3  1004  40  女
4  1005  40  女

In [48]:
#按指定列删除重复值
df_duplicate.drop_duplicates(subset=['年龄','性别'],keep=last)
#默认保留第1行，keep=last表示保留最后一行

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
3  1004  40  女

# 2.3 异常值的检测与处理

异常值检测
1）根据业务经验划定不同指标的正常范围，超出该范围的值算作异常值；
2）绘制箱形图，若数据服从正态分布，可用3σ原则，超过3σ的值为异常值；绘制方法会之后章节讲解。
异常值处理---通过data.describe()和绘制箱形图或直方图查看数据分布发现异常值

异常值处理 可以进行数据筛选和数据替换，也会在之后章节介绍。

# 2.4 数据类型转换

1)查看数据类型
python主要有6种数据类型---int整数，float浮点数，object对象类型，str字符串类型，unicode固定长度字符串，datetime64时间格式；
可以用df.info()查询每一列数据类型和df['列名'].dtype查看指定列数据类型
#sql里面的查看数据类型语句，desc 表名 或者 show columns from 表名

In [1]:
import pandas as pd
df_type=pd.DataFrame([['1001','50','男'],
              ['1002','20','女'],
                ['1004','40','女']],columns=['编号','年龄','性别'])
df_type

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
2  1004  40  女

In [2]:
df_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
编号    3 non-null object
年龄    3 non-null object
性别    3 non-null object
dtypes: object(3)
memory usage: 152.0+ bytes

In [3]:
df_type['编号'].dtype

dtype('O')

2）数据类型转换 不同的数据类型可以做不同的事情，用df['列名']=df['列名'].astype('类型名')进行转换
#sql里面数据类型转换 cast(a.consume_date as char(10)) as consume_date

In [8]:
df_type['年龄']=df_type['年龄'].astype('str')

In [9]:
df_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
编号    3 non-null object
年龄    3 non-null object
性别    3 non-null object
dtypes: object(3)
memory usage: 152.0+ bytes

# 2.5 索引设置

索引是查找数据的依据，df.columns=[]传入列索引，df.index=[]传入行索引;
df.set_index('')重置行索引列;df.reset_index()重置各级别列索引，常用于数据分组、数据透视表中。
df.rename(columns={'旧列名1':'新列名1','旧列名2':'新列名2'})重命名列标题；
df.rename(index={1:'新行名1',2:'新行名2'})重命名行标题；

In [57]:
df_index=df_type.set_index('编号')
df_index

      年龄 性别
编号
1001  50  男
1002  20  女
1004  40  女

In [58]:
df_index.rename(columns={'编号':'ID','年龄':'age','性别':'sex'})

     age sex
编号
1001  50   男
1002  20   女
1004  40   女

In [60]:
df_index.rename(index={'1001':'u1001'})

       年龄 性别
编号
u1001  50  男
1002   20  女
1004   40  女

In [61]:
#重置索引
df_index.reset_index(level=0)

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
2  1004  40  女

# 2.6数值操作

# 2.7 字符串截取操作

In [13]:
str = '0123456789'
print(str[0:3]) #截取第一位到第三位的字符
print str[:] #截取字符串的全部字符
print str[6:] #截取第七个字符到结尾
print str[:-3] #截取从头开始到倒数第三个字符之前
print str[2] #截取第三个字符
print str[-1] #截取倒数第一个字符
print str[::-1] #创造一个与原字符串顺序相反的字符串
print str[-3:-1] #截取倒数第三位与倒数第一位之前的字符
print str[-3:] #截取倒数第三位到结尾
print str[:-5:-3] #逆序截取，具体啥意思没搞明白？

012

# 2.8重命名列名

In [1]:
import pandas as pd
a = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]}) 
a.rename(columns={'A':'a', 'B':'b', 'C':'c'}, inplace = True)
a

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

# 2.9 用get_dummies将文本数据转化为数值

In [ ]:
#用pandas打开csv文件
import pandas as pd
data=pd.read_csv(r'/Users/Eric/Documents/2019/learning/Python机器学习/adult.csv', header=None,encoding="gbk",
                  names=['年龄','单位性质','权重','学历','受教育时长',
                        '婚姻状况','职业','家庭情况','种族','性别',
                        '资产所得','资产损失','周工作时长','原籍',
                        '收入'])
#用get_dummies将文本数据转化为数值
data_dummies=pd.get_dummies(data)
data_dummies.head(2)

# 2.8 本关作业

In [ ]:
1、怎么查看缺失值？---df.info(),df.isnull()
2、怎么删除缺失值？---df.dropna()
3、怎么只删除全为缺失值的行？---df.dropna(how=all)
4-5、怎么填充缺失值？---df.fillna({'列名':'值'})
6、怎么删除重复值？---df.drop_duplicates(subset=['列1','列2']，)
7-8、删除重复值时默认保留第一行还是最后一行？---第一行，设置参数keep=first/last
9、怎么查看列类型？---df['列名'].dtype
10、怎么将1列设置为索引列？---df.set_index('列名')
11、怎么修改列索引名字？---df.rename(index={'原索引名':'新索引名'})

# 三、数据选择

# 3.1 列选择

In [89]:
df_choose=pd.DataFrame([['1001','50','男','李四'],
              ['1002','20','女','张三'],
                ['1004','40','女','孙五']],columns=['编号','年龄','性别','姓名'])
df_choose

     编号  年龄 性别  姓名
0  1001  50  男  李四
1  1002  20  女  张三
2  1004  40  女  孙五

In [64]:
#按列名选择---普通索引--df[['列名1','列名2']---同时选择多个列要用 一个list存起来
df_choose[['编号','姓名']]

     编号  姓名
0  1001  李四
1  1002  张三
2  1004  孙五

In [66]:
#按位置选择---位置索引---df.iloc[[行1，行2]，[列1，列2]]---行列位置从0开始，多行多列用逗号隔开，用:表示全部(不需要[])
df_choose.iloc[:,[0,2]]

     编号 性别
0  1001  男
1  1002  女
2  1004  女

In [67]:
df_choose.iloc[[0,2],:]

     编号  年龄 性别  姓名
0  1001  50  男  李四
2  1004  40  女  孙五

In [69]:
#选择连续的列---df.iloc[行1:行2，列1:列2]
df_choose.iloc[:,0:2]

     编号  年龄
0  1001  50
1  1002  20
2  1004  40

# 3.2 行选择

In [73]:
#按行名选择---普通索引---df.loc[['行名1','行名2']]------同时选择多行要用 一个list存起来
df_choose.loc[[0,1]]

     编号  年龄 性别  姓名
0  1001  50  男  李四
1  1002  20  女  张三

In [71]:
#按位置选择---位置索引---df.iloc[[行1，行2]，[列1，列2]]---行列位置从0开始，多行多列用逗号隔开，用:表示全部(不需要[])
df_choose.iloc[[0,1]]

     编号  年龄 性别  姓名
0  1001  50  男  李四
1  1002  20  女  张三

# 3.3 选择满足条件的行

In [77]:
#传人一个判断条件来选择数据---布尔索引---df[(df['列名1']<10)&(df['列名2']<20)]
df_choose['年龄'].astype('int')

0    50
1    20
2    40
Name: 年龄, dtype: int64

In [79]:
df_choose[df_choose['年龄'].astype('int')>30]

     编号  年龄 性别  姓名
0  1001  50  男  李四
2  1004  40  女  孙五

In [88]:
df_choose[(df_choose['年龄'].astype('int')>30)&(df_choose['性别']=='男')]

     编号  年龄 性别  姓名
0  1001  50  男  李四

# 3.4 行列同时选择
---sql里面就是通过select 列名 from 表名 where 条件来选择行列

所谓行列同时选择就是选择行和列的相交部分。普通索引传人行或列名，用loc方法；位置索引传人行或列位置区间，用iloc方法；普通+位置索引结合用ix方法

1）普通索引+普通索引选择指定的行和列---df.loc[['行名1','行名2'],['列名1','列名2']]

In [93]:
df_choose_2=pd.DataFrame([['1001','50','男','李四'],
              ['1002','20','女','张三'],
              ['1003','40','女','孙五'],
              ['1004','30','男','赵二']],columns=['编号','年龄','性别','姓名'])
df_choose_3=df_choose_2.set_index('编号')
df_choose_3

      年龄 性别  姓名
编号
1001  50  男  李四
1002  20  女  张三
1003  40  女  孙五
1004  30  男  赵二

In [98]:
df_choose_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
编号    4 non-null object
年龄    4 non-null object
性别    4 non-null object
姓名    4 non-null object
dtypes: object(4)
memory usage: 208.0+ bytes

In [94]:
df_choose_3.loc[['1001','1003'],['年龄','姓名']]

      年龄  姓名
编号
1001  50  李四
1003  40  孙五

2）位置索引+位置索引---df.iloc[[行1，行2]，[列1，列2]] 或 df.iloc[行1:行2，列1:列2] ---行列位置从0开始，多行多列用逗号隔开，用:表示全部(不需要[])

In [97]:
df_choose_3.iloc[[0,2],[1,2]]
#注意设置编号为索引之后，它已经不是正常列了，从年龄列为第0列开始

     性别  姓名
编号
1001  男  李四
1003  女  孙五

In [104]:
df_choose_3.iloc[0:2,1:2]

     性别
编号
1001  男
1002  女

3）布尔索引+普通索引---df[(df['列名1']<10)&(df['列名2']<20)][[列1，列2]]---注意取多个列时要用[]存储起来

In [103]:
df_choose_3[df_choose_3['年龄'].astype('int')<40][['年龄','姓名']]

      年龄  姓名
编号
1002  20  张三
1004  30  赵二

4)位置索引+普通索引---df.ix[[行1，行2],['列名1','列名2']]

In [106]:
df_choose_3.ix[0:2,['年龄','姓名']]

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

      年龄  姓名
编号
1001  50  李四
1002  20  张三

# 3.4 数值操作

1、数值替换
---常用在异常值替换处理、缺失值替换处理中，主要有一对一替换、多对一替换、多对多替换

In [132]:
#一对一替换---df['列名‘].replace('A-old','B-new')表示用B替换A
df_replace=pd.DataFrame([['1001','50','男','李四'],
              ['1002','20'],
              [],
              ['1004','240','男','赵二']],columns=['编号','年龄','性别','姓名'])
df_replace

     编号    年龄    性别    姓名
0  1001    50     男    李四
1  1002    20  None  None
2  None  None  None  None
3  1004   240     男    赵二

In [143]:
#对某一列进行替换
df_replace['年龄'].replace('240','30',inplace=True)
df_replace

     编号    年龄    性别    姓名
0  1001     2     男    李四
1  1002     2  None  None
2  None  None  None  None
3  1004     3     男    赵二

In [128]:
#对整个表进行替换,相当于fillna()方法
import numpy as np
df.replace(np.NaN,0)
#np.NaN是python中对缺失值的一种表示方法

     编号  年龄 性别
0  1001  50  男
1  1002  20  女
2  1003  30  0
3     0   0  0
4  1004  40  女

In [135]:
#多对一替换
#excel中用if函数，if(or(D:D=240,D:D=260),33,D:D)---如果D列等于240或260，则替换为33，否则为原值
#sql中update table[表名] setFields[字段名]=replace(Fields[字段名],'被替换原内容','要替换成的内容')
#python中df['列名‘].replace(['A1-old','A2-old'],'B-new')表示用B替换A1,A2
df_replace['年龄'].replace(['240','50'],'20',inplace=True)
df_replace

     编号    年龄    性别    姓名
0  1001    20     男    李四
1  1002    20  None  None
2  None  None  None  None
3  1004    30     男    赵二

In [139]:
#多对多替换---即在某个区域中借助多个一对一的替换
#excel中用if函数嵌套，if(D:D=240,32,if(D:D=260,33,if(D:D=280,34,D:D)))---如果D列为240替换为32；为260替换为33；为280替换为34；否则原值
#SQL中进行多次replace函数
#python中df['列名‘].replace({'A1-old':'B1-new','A2-old':'B2-new'})表示用B1替换A1,B2替换A2
df_replace['年龄'].replace({'20':'2','30':3},inplace=True)
df_replace

     编号    年龄    性别    姓名
0  1001     2     男    李四
1  1002     2  None  None
2  None  None  None  None
3  1004     3     男    赵二

2、数值排序

1）按照一列数值进行排序
excel中用排序和筛选按钮；
sql中用order by实现---selext 列名 from 表名 order by 列1 desc/asc ---默认升序
python中用df.sort_values(by=["列1"],ascending=False/True,na_position='first'/'last')---表示按照列1排列，ascending默认是升序排列,false表示降序；当有缺失值时，na_position参数默认把缺失值放在最后，first表示放在最前。

In [150]:
df_sort=pd.DataFrame([['1001','50','男','李四'],
              ['1002','20','女'],
              ['1003'],
              ['1004','30','男','赵二']],columns=['编号','年龄','性别','姓名'])
df_sort

     编号    年龄    性别    姓名
0  1001    50     男    李四
1  1002    20     女  None
2  1003  None  None  None
3  1004    30     男    赵二

In [152]:
df_sort.sort_values(by='年龄',ascending=False,na_position='first')

     编号    年龄    性别    姓名
2  1003  None  None  None
0  1001    50     男    李四
3  1004    30     男    赵二
1  1002    20     女  None

2)按多列数值排序
excel中使用自定义排序功能；
sql中用order by实现---selext 列名 from 表名 order by 列1，列2  desc/asc ---默认升序
python中用df.sort_values(by=["列1","列2"],ascending=[True,False])---表示先按照列1升序排列，当列1重复时再按照列2降序排列

3、数值排名
数值排名和数值排序是相对应的，排名会新增一列，这一列用来存放数据的排名的情况，从1开始。
excel中用rank.avg()和rank.eq()函数
SQL中 select *,Row_number() over(partition by name order by data desc) As id from 表 
python中 df['排名列'].rank(ascending=False/True,method='average/first/min/max'),ascending表示排序，默认升序；method用来指明待排序列值有重复值时的处理情况，average表示取平均值作为排名，first表示按先后顺序作为排名，min/max表示取最小/大值作为排名

In [166]:
import pandas as pd
import numpy as np
df_rank=pd.DataFrame([['A','1000'],
                    ['B','2000'],
                    ['C','1000'],
                    ['D','2000'],
                    ['E','3000']],columns=['员工','收入'],dtype=np.int8)
df_rank
#怎么修改df表的数据类型 https://www.cnblogs.com/xitingxie/p/8426340.html

  员工    收入
0  A  1000
1  B  2000
2  C  1000
3  D  2000
4  E  3000

In [168]:
df_rank.dtypes

员工    object
收入    object
dtype: object

In [186]:
df_rank['收入'] = df_rank['收入'] .apply(pd.to_numeric)

In [187]:
df_rank.dtypes

员工    object
收入     int64
dtype: object

In [188]:
df_rank_average=df_rank['收入'].rank(method='average')
df_rank_average

0    1.5
1    3.5
2    1.5
3    3.5
4    5.0
Name: 收入, dtype: float64

In [190]:
df_rank_first=df_rank['收入'].rank(method='first')
df_rank_first

0    1.0
1    3.0
2    2.0
3    4.0
4    5.0
Name: 收入, dtype: float64

In [191]:
df_rank_min=df_rank['收入'].rank(method='min')
df_rank_min

0    1.0
1    3.0
2    1.0
3    3.0
4    5.0
Name: 收入, dtype: float64

In [192]:
df_rank_max=df_rank['收入'].rank(method='max')
df_rank_max

0    2.0
1    4.0
2    2.0
3    4.0
4    5.0
Name: 收入, dtype: float64

4.数值删除

1）删除列
excel中直接删除；SQL中用delete函数；
python中df.drop(['列名1','列名2'],axis=1) 或者 df.drop(df.columns[[位置1，位置2]],axis=1) 或者df.drop(columns=['列名1','列名2'])

2）删除行
excel中直接删除；SQL中用delete函数；
python中df.drop(['行名1','行名2'],axis=0) 或者 df.drop(df.index[[位置1，位置2]],axis=1) 或者df.drop(index=['行名1','行名2'])

In [ ]:
3）删除特定行
excel中先将符合条件的行筛选出来再删除；
SQL中也是先用where条件语句把符合条件的行筛选出来；
python是用df[df['列名']<值]把符合条件的行筛选出来作为新的数据源。

5、数值计数

excel中用countif()函数；
sql中用select A,count(B) from 表 group by A
python中用df['列名'].value_counts()---统计绝对次数，传入参数normalize=True可获得相对占比，传入参数sort=False可实现降序排序

In [193]:
import pandas as pd
import numpy as np
df_count=pd.DataFrame([['A','1000'],
                    ['B','2000'],
                    ['C','1000'],
                    ['D','2000'],
                    ['E','3000']],columns=['员工','收入'],dtype=np.int8)
df_count

  员工    收入
0  A  1000
1  B  2000
2  C  1000
3  D  2000
4  E  3000

In [194]:
df_count['收入'].value_counts()

2000    2
1000    2
3000    1
Name: 收入, dtype: int64

In [195]:
df_count['收入'].value_counts(normalize=True)

2000    0.4
1000    0.4
3000    0.2
Name: 收入, dtype: float64

In [196]:
df_count['收入'].value_counts(normalize=True,sort=False)

1000    0.4
2000    0.4
3000    0.2
Name: 收入, dtype: float64

6、唯一值获取

excel中需要把某列数值复制粘贴出来，删除重复项，获得唯一值；
sql中用select A,count(distinct B) from 表名 group by A;
python中用df['列名'].unique()实现

In [197]:
df_count['收入'].unique()

array(['1000', '2000', '3000'], dtype=object)

7、数值查找

数值查找指查看表中的数据是否包含某个值或某些值

excel中通过查找和选择功能实现；
sql中通过select * from 表名 where 列名 in('A','B')
python中用df['列名'].isin(['A','B'])

In [199]:
df_count['收入'].isin(['3000','5000'])

0    False
1    False
2    False
3    False
4     True
Name: 收入, dtype: bool

8、区间切分

区间切分就是将一系列数值分成若干份，这个切分过程就称为区间切分

excel中用if(D2<4,'小于4',if(D2<7,'4-6','大于6'))---if(条件，条件真时返回值，条件假时返回值)
sql中也是用if函数：SELECT IF(sva=1,"男","女") AS s FROM table_name WHERE sva != '';
python中用cut()方法，pd.cut(df['列名'],bins=[切分点1，切分点2，切分点3，切分点4])；
或者qcut()方法，pd.qcut(df['列名'],n)---n表示切分个数，它会平均切割各组数据

In [201]:
import pandas as pd
import numpy as np
df_cut=pd.DataFrame([['1001',10], ['1002',20],['1003',30],['1004',40],['1005',50],
                    ['1006',15], ['1007',25],['1008',35],['1009',45],['1010',55]],columns=['员工','收入'],dtype=np.int8)
df_cut

     员工  收入
0  1001  10
1  1002  20
2  1003  30
3  1004  40
4  1005  50
5  1006  15
6  1007  25
7  1008  35
8  1009  45
9  1010  55

In [202]:
df_cut.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
员工    10 non-null object
收入    10 non-null int8
dtypes: int8(1), object(1)
memory usage: 170.0+ bytes

In [232]:
pd.cut(df_cut['收入'],bins=(0,20,40,60))

0     (0, 20]
1     (0, 20]
2    (20, 40]
3    (20, 40]
4    (40, 60]
5     (0, 20]
6    (20, 40]
7    (20, 40]
8    (40, 60]
9    (40, 60]
Name: 收入, dtype: category
Categories (3, interval[int64]): [(0, 20] < (20, 40] < (40, 60]]

In [205]:
pd.qcut(df_cut['收入'],3)

0    (9.999, 25.0]
1    (9.999, 25.0]
2     (25.0, 40.0]
3     (25.0, 40.0]
4     (40.0, 55.0]
5    (9.999, 25.0]
6    (9.999, 25.0]
7     (25.0, 40.0]
8     (40.0, 55.0]
9     (40.0, 55.0]
Name: 收入, dtype: category
Categories (3, interval[float64]): [(9.999, 25.0] < (25.0, 40.0] < (40.0, 55.0]]

9、插入新的行或列

插入操作有两点，一个是在哪插入，另一个是插入什么

excel中使用插入操作插入新的行或列；
sql中使用insert into 表名 (列名1，列名2...) values() 插入新的行；通过alter table 表名 add column 列名 varchar(30)插入新的列；
设定为第一列：alter table 表名 add 字段名 字段类型 first；设定位于某个字段之后：alter table 表名 add 字段名 字段类型 after 字段名；
python中没有专门用来插入行的方法，可以把待插入的行当作一个新表，然后将两个表进行拼接，表拼接后续章节会讲；
python中使用df.insert(列位置,'新列名',[数据])来插入新的列

In [209]:
df_cut.insert(1,'部门',[1,2,3,4,5,6,7,8,9,10])

In [210]:
df_cut

     员工  部门  年龄  收入
0  1001   1   1  10
1  1002   2   2  20
2  1003   3   3  30
3  1004   4   4  40
4  1005   5   5  50
5  1006   6   6  15
6  1007   7   7  25
7  1008   8   8  35
8  1009   9   9  45
9  1010  10  10  55

10、行列互换（转置）

excel中是先复制，再使用选择性粘贴中选择转置；
sql中用pivot函数，SELECT year as 年份, Q1 as 一季度, Q2 as 二季度, Q3 as 三季度, Q4 as 四季度 FROM SalesByQuarter PIVOT (SUM (amount) FOR quarter IN (Q1, Q2, Q3, Q4) ) AS P ORDER BY YEAR DESC；具体见https://www.cnblogs.com/zouhao/p/6050809.html；
python中是直接在源数据表的基础上调用.T，df.T

In [211]:
df_cut.T

       0     1     2     3     4     5     6     7     8     9
员工  1001  1002  1003  1004  1005  1006  1007  1008  1009  1010
部门     1     2     3     4     5     6     7     8     9    10
年龄     1     2     3     4     5     6     7     8     9    10
收入    10    20    30    40    50    15    25    35    45    55

11、索引重塑

所谓的索引重塑就是将原来的索引进行重新构造。
df.stack()---将表格型数据转换成树形数据；
df.unstack()---将树形数据转换成表格型数据

12、长宽表转换

长宽表转换就是将比较长（很多行）的表转换成比较宽的表（很多列），或者反过来

1）宽表转换为长表
exclel中也是用选择性粘贴实现；
sql中无该操作
python中有两种方法，一种是stack(),另一种是melt();

stack()方法

In [216]:
df_stack=pd.DataFrame([['apple','苹果',5000,6000,6500,7000],
                     ['google','谷歌',3000,4000,5000,5500],
                     ['facebook','脸书',2000,3000,4000,4500]],columns=(['company','name','Y2015','Y2016','Y2017','Y2018']))
df_stack

    company name  Y2015  Y2016  Y2017  Y2018
0     apple   苹果   5000   6000   6500   7000
1    google   谷歌   3000   4000   5000   5500
2  facebook   脸书   2000   3000   4000   4500

In [217]:
df_stack.T

             0       1         2
company  apple  google  facebook
name        苹果      谷歌        脸书
Y2015     5000    3000      2000
Y2016     6000    4000      3000
Y2017     6500    5000      4000
Y2018     7000    5500      4500

In [221]:
df_stack.stack()

0  company       apple
   name             苹果
   Y2015          5000
   Y2016          6000
   Y2017          6500
   Y2018          7000
1  company      google
   name             谷歌
   Y2015          3000
   Y2016          4000
   Y2017          5000
   Y2018          5500
2  company    facebook
   name             脸书
   Y2015          2000
   Y2016          3000
   Y2017          4000
   Y2018          4500
dtype: object

In [218]:
#1)先设置行索引
df_stack.set_index(['company','name'])

               Y2015  Y2016  Y2017  Y2018
company  name
apple    苹果     5000   6000   6500   7000
google   谷歌     3000   4000   5000   5500
facebook 脸书     2000   3000   4000   4500

In [219]:
#2)用stack()将列索引也转换成行索引
df_stack.set_index(['company','name']).stack()

company   name
apple     苹果    Y2015    5000
                Y2016    6000
                Y2017    6500
                Y2018    7000
google    谷歌    Y2015    3000
                Y2016    4000
                Y2017    5000
                Y2018    5500
facebook  脸书    Y2015    2000
                Y2016    3000
                Y2017    4000
                Y2018    4500
dtype: int64

In [220]:
#3)再用reset_index()进行索引重置
df_stack.set_index(['company','name']).stack().reset_index()

     company name level_2     0
0      apple   苹果   Y2015  5000
1      apple   苹果   Y2016  6000
2      apple   苹果   Y2017  6500
3      apple   苹果   Y2018  7000
4     google   谷歌   Y2015  3000
5     google   谷歌   Y2016  4000
6     google   谷歌   Y2017  5000
7     google   谷歌   Y2018  5500
8   facebook   脸书   Y2015  2000
9   facebook   脸书   Y2016  3000
10  facebook   脸书   Y2017  4000
11  facebook   脸书   Y2018  4500

melt()方法

In [224]:
df_stack2=df_stack.melt(id_vars=['company','name'],
             var_name='year',
             value_name='sale')
#id_vars参数用于指明保持不变的列，var_name参数表示多列表头转1列后的列名，value_name参数表示数值的列名
df_stack2

     company name   year  sale
0      apple   苹果  Y2015  5000
1     google   谷歌  Y2015  3000
2   facebook   脸书  Y2015  2000
3      apple   苹果  Y2016  6000
4     google   谷歌  Y2016  4000
5   facebook   脸书  Y2016  3000
6      apple   苹果  Y2017  6500
7     google   谷歌  Y2017  5000
8   facebook   脸书  Y2017  4000
9      apple   苹果  Y2018  7000
10    google   谷歌  Y2018  5500
11  facebook   脸书  Y2018  4500

2)长表转换为宽表
excel中就是用数据透视表；
sql中也是数据透视表思想，用pivot函数，SELECT year as 年份, Q1 as 一季度, Q2 as 二季度, Q3 as 三季度, Q4 as 四季度 FROM SalesByQuarter PIVOT (SUM (amount) FOR quarter IN (Q1, Q2, Q3, Q4) ) AS P ORDER BY YEAR DESC；具体见https://www.cnblogs.com/zouhao/p/6050809.html；
python中用df.pivot_table(index=['col1','col2'],columns='col3',values='col4')

In [225]:
df_stack2.pivot_table(index=['company','name'],columns='year',values='sale')

year           Y2015  Y2016  Y2017  Y2018
company  name
apple    苹果     5000   6000   6500   7000
facebook 脸书     2000   3000   4000   4500
google   谷歌     3000   4000   5000   5500

13、apply()与applymap()函数

之前介绍的map()函数是用来对一个序列中的所有元素执行相同的函数操作；
DataFrame中与map函数相似的有两个函数，apply()和applymap()函数，都需要和匿名函数lambda结合使用。

apply()主要是对df表中的某一列或行的元素执行相同的操作

In [228]:
df_apply=pd.DataFrame([[0,1,2],[4,5,6],[7,8,9]],columns=['a','b','c'])
df_apply

   a  b  c
0  0  1  2
1  4  5  6
2  7  8  9

In [229]:
df_apply.apply(lambda x:x+1)

   a  b   c
0  1  2   3
1  5  6   7
2  8  9  10

applymap()主要是对df表中的每一个元素执行相同的操作

In [230]:
df_apply.applymap(lambda x:x+1)

   a  b   c
0  1  2   3
1  5  6   7
2  8  9  10

# 3.5 本关作业

【行列选择】
1、当用位置索引选择列时需要用什么函数？---df.iloc[]
2、当用普通索引协作行时需要用什么函数？---df.loc[]
3、选择df表中col列小于5的所有行？---df[df['col']<5]
4、选择df表中col1列小于5的col2行？---df[df['col1']<5]['col2']
5、iloc、loc、ix这3个函数有什么区别？---位置索引、普通索引、交叉索引

【数值操作一】
1、数值替换用什么函数？---df['列名‘].replace('A-old','a-new')表示用a替换A
2、数值排序用什么函数？---df.sort_values(by=["列1","列2"],ascending=[True,False])---表示先按照列1升序排列，当列1重复时再按照列2降序排列
3、数值排名用什么函数？---df['排名列'].rank(ascending=False/True,method='average/first/min/max'),ascending表示排序，默认升序；method用来指明待排序列值有重复值时的处理情况，average表示取平均值作为排名，first表示按先后顺序作为排名，min/max表示取最小/大值作为排名
4、列删除？---df.drop(['列名1','列名2'],axis=1) 或者 df.drop(df.columns[[位置1，位置2]],axis=1) 或者df.drop(columns=['列名1','列名2'])

【数值操作二】
1、将df表的col1列等区间切割成5份？---pd.qcut(df['col1'],5)
2、将df表的col1列分成0-20，20-40，40-60？---pd.cut(df['col1',bins=[0,20,40,60]])
3、将df表的col列插入到df表中第3列，新列名n_col?---python中使用df.insert(列位置,'新列名',[数据])来插入新的列--df.insert(3,'n_col',[col])
4、将df表的col列插入到df表中最后一列，新列名n_col?---
5、表格型数据转化为属性结构---用df.stack()；反之用df.unstack()
6、利用apply将df表col1列每个数值都扩大2倍？---df['col1'].apply(lambda x:x*2)
7、利用applymap函数和if函数，根据：如果大于0则置为1，否则为0---

In [242]:
df_apply.applymap(lambda x:1 if x>0 else 0)

   a  b  c
0  0  1  1
1  1  1  1
2  1  1  1